modm-ext/data.modm.io/docs/svd/header_stm32h747xx_cm4.svd
        <register>
          <name>TIMDISR</name>
          <description>HRTIM Timerx interrupt status register</description>
          <addressOffset>0x204</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CMP1</name>
              <description>Slave compare 1 interrupt flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMP2</name>
              <description>Slave compare 2 interrupt flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMP3</name>
              <description>Slave compare 3 interrupt flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMP4</name>
              <description>Slave compare 4 interrupt flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>REP</name>
              <description>Slave repetition interrupt flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UPD</name>
              <description>Slave update interrupt flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPT1</name>
              <description>Slave capture 1 interrupt flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPT2</name>
              <description>Slave capture 2 interrupt flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SET1</name>
              <description>Slave output 1 set interrupt flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RST1</name>
              <description>Slave output 1 reset interrupt flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SET2</name>
              <description>Slave output 2 set interrupt flag</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RST2</name>
              <description>Slave output 2 reset interrupt flag</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RST</name>
              <description>Slave reset interrupt flag</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DLYPRT</name>
              <description>Slave output 1 delay protection interrupt flag</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPPSTAT</name>
              <description>Slave current push-pull flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IPPSTAT</name>
              <description>Slave idle push-pull flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>O1STAT</name>
              <description>Slave output 1 state flag</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>O2STAT</name>
              <description>Slave output 2 state flag</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>O1CPY</name>
              <description>Slave output 1 copy flag</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>O2CPY</name>
              <description>Slave output 2 copy flag</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMDICR</name>
          <description>HRTIM Timerx interrupt clear register</description>
          <addressOffset>0x208</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CMP1C</name>
              <description>Slave compare 1 clear flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMP2C</name>
              <description>Slave compare 2 clear flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMP3C</name>
              <description>Slave compare 3 clear flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMP4C</name>
              <description>Slave compare 4 clear flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>REPC</name>
              <description>Slave repetition clear flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UPDC</name>
              <description>Slave update clear flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPT1C</name>
              <description>Slave capture 1 clear flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPT2C</name>
              <description>Slave capture 2 clear flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SET1C</name>
              <description>Slave output 1 set clear flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RST1C</name>
              <description>Slave output 1 reset clear flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SET2C</name>
              <description>Slave output 2 set clear flag</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RST2C</name>
              <description>Slave output 2 reset clear flag</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RSTC</name>
              <description>Slave reset clear flag</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DLYPRTC</name>
              <description>Slave output 1 delay protection clear flag</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMDDIER</name>
          <description>HRTIM Timerx DMA/interrupt enable register</description>
          <addressOffset>0x20c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CMP1IE</name>
              <description>Slave compare 1 interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMP2IE</name>
              <description>Slave compare 2 interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMP3IE</name>
              <description>Slave compare 3 interrupt enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMP4IE</name>
              <description>Slave compare 4 interrupt enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>REPIE</name>
              <description>Slave repetition interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UPDIE</name>
              <description>Slave update interrupt enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPT1IE</name>
              <description>Slave capture 1 interrupt enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPT2IE</name>
              <description>Slave capture 2 interrupt enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SET1IE</name>
              <description>Slave output 1 set interrupt enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RST1IE</name>
              <description>Slave output 1 reset interrupt enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SET2IE</name>
              <description>Slave output 2 set interrupt enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RST2IE</name>
              <description>Slave output 2 reset interrupt enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RSTIE</name>
              <description>Slave reset interrupt enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DLYPRTIE</name>
              <description>Slave delay protection interrupt enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMP1DE</name>
              <description>Slave compare 1 request enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMP2DE</name>
              <description>Slave compare 2 request enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMP3DE</name>
              <description>Slave compare 3 request enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMP4DE</name>
              <description>Slave compare 4 request enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>REPDE</name>
              <description>Slave repetition request enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UPDDE</name>
              <description>Slave update request enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPT1DE</name>
              <description>Slave capture 1 request enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPT2DE</name>
              <description>Slave capture 2 request enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SET1DE</name>
              <description>Slave output 1 set request enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RST1DE</name>
              <description>Slave output 1 reset request enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SET2DE</name>
              <description>Slave output 2 set request enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RST2DE</name>
              <description>Slave output 2 reset request enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RSTDE</name>
              <description>Slave reset request enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DLYPRTDE</name>
              <description>Slavedelay protection request enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CNTDR</name>
          <description>HRTIM Timerx counter register</description>
          <addressOffset>0x210</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CNTR</name>
              <description>Counter Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PERDR</name>
          <description>HRTIM Timerx period register</description>
          <addressOffset>0x214</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>REPDR</name>
          <description>HRTIM Timerx repetition register</description>
          <addressOffset>0x218</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CMP1DR</name>
          <description>HRTIM Timerx compare 1 register</description>
          <addressOffset>0x21c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CMP1R</name>
              <description>Compare Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CMP1CDR</name>
          <description>HRTIM Timerx compare 1 compound register</description>
          <addressOffset>0x220</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CMP1CR</name>
              <description>Compare Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CMP2DR</name>
          <description>HRTIM Timerx compare 2 register</description>
          <addressOffset>0x224</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CMP2R</name>
              <description>Compare Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CMP3DR</name>
          <description>HRTIM Timerx compare 3 register</description>
          <addressOffset>0x228</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CMP3R</name>
              <description>Compare Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CMP4DR</name>
          <description>HRTIM Timerx compare 4 register</description>
          <addressOffset>0x22c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CMP4R</name>
              <description>Compare Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CPT1DR</name>
          <description>HRTIM Timerx capture 1 register</description>
          <addressOffset>0x230</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CPT1R</name>
              <description>Capture Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CPT2DR</name>
          <description>HRTIM Timerx capture 2 register</description>
          <addressOffset>0x234</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CPT2R</name>
              <description>Capture Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DTDR</name>
          <description>HRTIM Timerx dead time register</description>
          <addressOffset>0x238</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DTR</name>
              <description>Dead time rising value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>SDTR</name>
              <description>Sign dead time rising value</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTPRSC</name>
              <description>Dead time prescaler</description>
              <bitOffset>10</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>DTRSLK</name>
              <description>Dead time rising sign lock</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTRLK</name>
              <description>Dead time rising lock</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTF</name>
              <description>Dead time falling value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>SDTF</name>
              <description>Sign dead time falling value</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTFSLK</name>
              <description>Dead time falling sign lock</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTFLK</name>
              <description>Dead time falling lock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
